Project/Toir/src/Catalogs/торо_ЦепочкиРемонта/торо_ЦепочкиРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ЦепочкиРемонта</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>СпособУчетаДатыОтсчета</name>
    <type>
      <types>EnumRef.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПоследовательностьРемонтов</name>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>НормативныйРемонт</name>
      <type>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособПланирования</name>
      <type>
        <types>CatalogRef.торо_СпособыПланированияРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРемонтныхРабот</name>
      <type>
        <types>CatalogRef.Календари</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособВыполнения</name>
      <type>
        <types>EnumRef.СпособыСтроительства</types>
      </type>
    </attributes>
    <attributes>
      <name>РазрешитьСокращатьМежремонтныйПериодПриПланировании</name>
      <comment>Разрешить сокращать межремонтный период в случае, если начало ремонта приходится на выходной день</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеУчитыватьПриПланированииГрафикРаботыОборудования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеУчитыватьПриПланированииГрафикРемонтныхРабот</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеУчитыватьПродолжительность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УчитыватьПростоиОборудования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/InformationRegisters/торо_РемонтныеЦиклыОборудования/торо_РемонтныеЦиклыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_РемонтныеЦиклыОборудования</name>
  <resources>
    <name>НеУчитыватьПростоиОборудования</name>
    <comment>Использовать плановую наработка во время простоя (т.е. планировать ТО по наработке во время простоя)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидЦепочки</name>
    <type>
      <types>CatalogRef.торо_ЦепочкиРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаОбъектовРемонтов</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_НормативныеРемонтыОборудования/торо_НормативныеРемонтыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_НормативныеРемонтыОборудования</name>
  <resources>
    <name>НормативныйРемонт</name>
    <type>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </resources>
  <resources>
    <name>СпособПланирования</name>
    <type>
      <types>CatalogRef.торо_СпособыПланированияРемонтныхРабот</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРемонтныхРабот</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>НеИспользоватьВПланированииДатуВводаВЭксплуатацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособУчетаДатыОтсчета</name>
    <type>
      <types>EnumRef.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот</types>
    </type>
  </resources>
  <resources>
    <name>НеУчаствуетВПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьСокращатьМежремонтныйПериодПриПланировании</name>
    <comment>Разрешить сокращать межремонтный период в случае, если начало ремонта приходится на выходной день</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПриПланированииГрафикРаботыОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПриПланированииГрафикРемонтныхРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПродолжительность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьКоэффициентыРемонтныхОсобенностей</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьПростоиОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтратегияОбслуживания</name>
    <type>
      <types>CatalogRef.торо_СтратегииОбслуживания</types>
    </type>
  </resources>
  <resources>
    <name>ИсточникСтратегии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТиповойОР</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/торо_СтатусыНормативныхРемонтовИТехКарт/торо_СтатусыНормативныхРемонтовИТехКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_СтатусыНормативныхРемонтовИТехКарт</name>
  <enumValues>
    <name>ВРазработке</name>
  </enumValues>
  <enumValues>
    <name>Действует</name>
  </enumValues>
  <enumValues>
    <name>Редактируется</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Catalogs/торо_ТиповыеОР/торо_ТиповыеОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ТиповыеОР</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Изготовитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>String</types>
      <types>CatalogRef.Производители</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>CatalogRef.торо_НаправленияОбъектовРемонтныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойствОР</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОРПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>КодГруппы</name>
    <type>
      <types>CatalogRef.гкс_ГруппыОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъекта</name>
    <type>
      <types>EnumRef.торо_ТипыОбъектовRCM</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Модель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Критичность</name>
    <comment>Гкс+[TOIR20-94] Борисов В.М. от 05.06.2020</comment>
    <type>
      <types>CatalogRef.гкс_Критичность</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ОтветственныйИнженер</name>
    <comment>Гкс+[TOIR20-94] Борисов В.М. от 05.06.2020</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НормативныеРемонты</name>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>НормативныйРемонт</name>
      <type>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособПланирования</name>
      <type>
        <types>CatalogRef.торо_СпособыПланированияРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.торо_СтатусыНормативныхРемонтовИТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРемонтныхРабот</name>
      <type>
        <types>CatalogRef.Календари</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособВыполнения</name>
      <type>
        <types>EnumRef.СпособыСтроительства</types>
      </type>
    </attributes>
    <attributes>
      <name>НеИспользоватьВПланированииДатуВводаВЭксплуатацию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособУчетаДатыОтсчета</name>
      <type>
        <types>EnumRef.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>НеУчаствуетВПланировании</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РазрешитьСокращатьМежремонтныйПериодПриПланировании</name>
      <comment>Разрешить сокращать межремонтный период в случае, если начало ремонта приходится на выходной день</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеУчитыватьПриПланированииГрафикРаботыОборудования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеУчитыватьПриПланированииГрафикРемонтныхРабот</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеУчитыватьПродолжительность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьКоэффициентыРемонтныхОсобенностей</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УчитыватьПростоиОборудования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПредшествующиеРемонты</name>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредшествующийВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗамещаемыеРемонты</name>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗамещаемыйВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособЗамещения</name>
      <type>
        <types>EnumRef.торо_СпособыЗамещенияРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>НачальнаяГраница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонечнаяГраница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Запчасти</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>EnumRef.ГрадацииКачества</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НормативныеЗатратыПриТОиР</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОграниченияНаХарактеристикиОборудования</name>
    <attributes>
      <name>Ограничение</name>
      <type>
        <types>CatalogRef.торо_ОграниченияНаХарактеристикиОбрудования</types>
      </type>
    </attributes>
    <attributes>
      <name>Иерархия</name>
      <type>
        <types>CatalogRef.торо_СтруктурыОР</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>гкс_КонструктивныйСостав</name>
    <attributes>
      <name>Компонент</name>
      <type>
        <types>CatalogRef.гкс_Компоненты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/Catalogs/торо_ЦепочкиРемонта/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		Если НЕ ЗначениеЗаполнено(ТекущийОбъект.СпособУчетаДатыОтсчета) Тогда
		
		ТекстСообщения = НСтр("es='"". La anotación es imposible.';ru='Не заполнено поле ""Способ учета даты отсчета"". Запись невозможна.';en='The ""Countdown date accounting method"" field is not filled. Recording is not possible.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		Возврат;
		
	КонецЕсли;
	Если не ТекущийОбъект.ЭтоНовый() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_РемонтныеЦиклыОборудования.ВидЦепочки,
		               |	торо_РемонтныеЦиклыОборудования.ГруппаОбъектовРемонтов
		               |ПОМЕСТИТЬ торо_РемонтныеЦиклыОборудованияЦепочки
		               |ИЗ
		               |	РегистрСведений.торо_РемонтныеЦиклыОборудования КАК торо_РемонтныеЦиклыОборудования
		               |ГДЕ
		               |	торо_РемонтныеЦиклыОборудования.ВидЦепочки = &Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	&Ссылка КАК Цепочка,
		               |	торо_ЦепочкиРемонтаПоследовательностьРемонтов.ВидРемонта
		               |ПОМЕСТИТЬ ПоследовательностьРабот
		               |ИЗ
		               |	&ПоследовательностьРемонтов КАК торо_ЦепочкиРемонтаПоследовательностьРемонтов
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	торо_РемонтныеЦиклыОборудования.ВидЦепочки,
		               |	торо_РемонтныеЦиклыОборудования.ГруппаОбъектовРемонтов,
		               |	ПоследовательностьРабот.ВидРемонта
		               |ПОМЕСТИТЬ РемЦиклыСВидамиРемонтов
		               |ИЗ
		               |	торо_РемонтныеЦиклыОборудованияЦепочки КАК торо_РемонтныеЦиклыОборудования
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ПоследовательностьРабот КАК ПоследовательностьРабот
		               |		ПО торо_РемонтныеЦиклыОборудования.ВидЦепочки = ПоследовательностьРабот.Цепочка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РемЦиклыСВидамиРемонтов.ГруппаОбъектовРемонтов,
		               |	РемЦиклыСВидамиРемонтов.ВидРемонта,
		               |	РемЦиклыСВидамиРемонтов.ВидЦепочки
		               |ПОМЕСТИТЬ РемонтныеЦиклыОР
		               |ИЗ
		               |	РемЦиклыСВидамиРемонтов КАК РемЦиклыСВидамиРемонтов
		               |ГДЕ
		               |	ТИПЗНАЧЕНИЯ(РемЦиклыСВидамиРемонтов.ГруппаОбъектовРемонтов) = ТИП(Справочник.торо_ОбъектыРемонта)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РемЦиклыСВидамиРемонтов.ГруппаОбъектовРемонтов,
		               |	РемЦиклыСВидамиРемонтов.ВидРемонта,
		               |	РемЦиклыСВидамиРемонтов.ВидЦепочки
		               |ПОМЕСТИТЬ РемонтныеЦиклыРГ
		               |ИЗ
		               |	РемЦиклыСВидамиРемонтов КАК РемЦиклыСВидамиРемонтов
		               |ГДЕ
		               |	ТИПЗНАЧЕНИЯ(РемЦиклыСВидамиРемонтов.ГруппаОбъектовРемонтов) = ТИП(Справочник.торо_ТиповыеОР)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	торо_РемонтныеЦиклыОборудованияЦепочки.ГруппаОбъектовРемонтов,
		               |	торо_РемонтныеЦиклыОборудования.ВидЦепочки
		               |ПОМЕСТИТЬ РемонтныеЦиклыОбъектовИГрупп
		               |ИЗ
		               |	РегистрСведений.торо_РемонтныеЦиклыОборудования КАК торо_РемонтныеЦиклыОборудования
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ торо_РемонтныеЦиклыОборудованияЦепочки КАК торо_РемонтныеЦиклыОборудованияЦепочки
		               |		ПО торо_РемонтныеЦиклыОборудования.ГруппаОбъектовРемонтов = торо_РемонтныеЦиклыОборудованияЦепочки.ГруппаОбъектовРемонтов
		               |ГДЕ
		               |	торо_РемонтныеЦиклыОборудования.ВидЦепочки <> &Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	торо_НормативныеРемонтыОборудования.ВидРемонта,
		               |	торо_РемонтныеЦиклыОборудованияЦепочки.ГруппаОбъектовРемонтов
		               |ПОМЕСТИТЬ НормативныеРемонтыОРИРГ
		               |ИЗ
		               |	РегистрСведений.торо_НормативныеРемонтыОборудования КАК торо_НормативныеРемонтыОборудования
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ торо_РемонтныеЦиклыОборудованияЦепочки КАК торо_РемонтныеЦиклыОборудованияЦепочки
		               |		ПО торо_НормативныеРемонтыОборудования.ОбъектРемонта = торо_РемонтныеЦиклыОборудованияЦепочки.ГруппаОбъектовРемонтов
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	торо_ТиповыеОРНормативныеРемонты.ВидРемонта,
		               |	торо_РемонтныеЦиклыОборудованияЦепочки.ГруппаОбъектовРемонтов
		               |ИЗ
		               |	Справочник.торо_ТиповыеОР.НормативныеРемонты КАК торо_ТиповыеОРНормативныеРемонты
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ торо_РемонтныеЦиклыОборудованияЦепочки КАК торо_РемонтныеЦиклыОборудованияЦепочки
		               |		ПО торо_ТиповыеОРНормативныеРемонты.Ссылка = торо_РемонтныеЦиклыОборудованияЦепочки.ГруппаОбъектовРемонтов
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РемонтныеЦиклыОбъектовИГрупп.ГруппаОбъектовРемонтов,
		               |	РемонтныеЦиклыОбъектовИГрупп.ВидЦепочки,
		               |	торо_ЦепочкиРемонтаПоследовательностьРемонтов.ВидРемонта
		               |ПОМЕСТИТЬ РемЦиклыОРИРГСВидамиРемонтов
		               |ИЗ
		               |	РемонтныеЦиклыОбъектовИГрупп КАК РемонтныеЦиклыОбъектовИГрупп
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ЦепочкиРемонта.ПоследовательностьРемонтов КАК торо_ЦепочкиРемонтаПоследовательностьРемонтов
		               |		ПО РемонтныеЦиклыОбъектовИГрупп.ВидЦепочки = торо_ЦепочкиРемонтаПоследовательностьРемонтов.Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	НормативныеРемонтыОРИРГ.ВидРемонта,
		               |	НормативныеРемонтыОРИРГ.ГруппаОбъектовРемонтов
		               |ПОМЕСТИТЬ ПересечениеВРЦепочкиСНРОР
		               |ИЗ
		               |	РемонтныеЦиклыОР КАК РемонтныеЦиклыОР
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НормативныеРемонтыОРИРГ КАК НормативныеРемонтыОРИРГ
		               |		ПО РемонтныеЦиклыОР.ГруппаОбъектовРемонтов = НормативныеРемонтыОРИРГ.ГруппаОбъектовРемонтов
		               |			И РемонтныеЦиклыОР.ВидРемонта = НормативныеРемонтыОРИРГ.ВидРемонта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	НормативныеРемонтыОРИРГ.ВидРемонта,
		               |	НормативныеРемонтыОРИРГ.ГруппаОбъектовРемонтов
		               |ПОМЕСТИТЬ ПересечениеВРЦепочкиСНРРГ
		               |ИЗ
		               |	РемонтныеЦиклыРГ КАК РемонтныеЦиклыРГ
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НормативныеРемонтыОРИРГ КАК НормативныеРемонтыОРИРГ
		               |		ПО РемонтныеЦиклыРГ.ГруппаОбъектовРемонтов = НормативныеРемонтыОРИРГ.ГруппаОбъектовРемонтов
		               |			И РемонтныеЦиклыРГ.ВидРемонта = НормативныеРемонтыОРИРГ.ВидРемонта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РемЦиклыОРИРГСВидамиРемонтов.ВидЦепочки,
		               |	РемонтныеЦиклыОР.ВидРемонта,
		               |	РемонтныеЦиклыОР.ГруппаОбъектовРемонтов
		               |ПОМЕСТИТЬ ПересечениеРемонтныхЦикловОР
		               |ИЗ
		               |	РемЦиклыОРИРГСВидамиРемонтов КАК РемЦиклыОРИРГСВидамиРемонтов
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РемонтныеЦиклыОР КАК РемонтныеЦиклыОР
		               |		ПО РемЦиклыОРИРГСВидамиРемонтов.ГруппаОбъектовРемонтов = РемонтныеЦиклыОР.ГруппаОбъектовРемонтов
		               |			И (РемонтныеЦиклыОР.ВидРемонта = РемЦиклыОРИРГСВидамиРемонтов.ВидРемонта)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РемЦиклыОРИРГСВидамиРемонтов.ВидЦепочки,
		               |	РемонтныеЦиклыРГ.ГруппаОбъектовРемонтов,
		               |	РемонтныеЦиклыРГ.ВидРемонта
		               |ПОМЕСТИТЬ ПересечениеРемЦикловРГ
		               |ИЗ
		               |	РемонтныеЦиклыРГ КАК РемонтныеЦиклыРГ
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РемЦиклыОРИРГСВидамиРемонтов КАК РемЦиклыОРИРГСВидамиРемонтов
		               |		ПО РемонтныеЦиклыРГ.ГруппаОбъектовРемонтов = РемЦиклыОРИРГСВидамиРемонтов.ГруппаОбъектовРемонтов
		               |			И РемонтныеЦиклыРГ.ВидРемонта = РемЦиклыОРИРГСВидамиРемонтов.ВидРемонта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	торо_НормативныеРемонтыОборудования.ОбъектРемонта КАК ГруппаОбъектовРемонтов,
		               |	торо_НормативныеРемонтыОборудования.ВидРемонта
		               |ПОМЕСТИТЬ ПересечениеЦепочекРГиНормативныхРемонтовОР
		               |ИЗ
		               |	РемонтныеЦиклыРГ КАК РемонтныеЦиклыРГ
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_НормативныеРемонтыОборудования КАК торо_НормативныеРемонтыОборудования
		               |		ПО РемонтныеЦиклыРГ.ГруппаОбъектовРемонтов = торо_НормативныеРемонтыОборудования.ОбъектРемонта.ТиповойОР
		               |			И РемонтныеЦиклыРГ.ВидРемонта = торо_НормативныеРемонтыОборудования.ВидРемонта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	торо_РемонтныеЦиклыОборудования.ВидЦепочки,
		               |	торо_РемонтныеЦиклыОборудования.ГруппаОбъектовРемонтов,
		               |	торо_ЦепочкиРемонтаПоследовательностьРемонтов.ВидРемонта
		               |ПОМЕСТИТЬ РемонтныеЦиклыОРПодчинРГизРЦРГ
		               |ИЗ
		               |	РегистрСведений.торо_РемонтныеЦиклыОборудования КАК торо_РемонтныеЦиклыОборудования
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ЦепочкиРемонта.ПоследовательностьРемонтов КАК торо_ЦепочкиРемонтаПоследовательностьРемонтов
		               |		ПО торо_РемонтныеЦиклыОборудования.ВидЦепочки = торо_ЦепочкиРемонтаПоследовательностьРемонтов.Ссылка
		               |ГДЕ
		               |	торо_РемонтныеЦиклыОборудования.ГруппаОбъектовРемонтов.ТиповойОР В
		               |			(ВЫБРАТЬ
		               |				РемонтныеЦиклыРГ.ГруппаОбъектовРемонтов
		               |			ИЗ
		               |				РемонтныеЦиклыРГ КАК РемонтныеЦиклыРГ)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	РемонтныеЦиклыОРПодчинРГизРЦРГ.ВидЦепочки,
		               |	РемонтныеЦиклыОРПодчинРГизРЦРГ.ГруппаОбъектовРемонтов,
		               |	РемонтныеЦиклыРГ.ВидРемонта
		               |ПОМЕСТИТЬ ПересечениеРЦРГсРЦПодчиненныхОР
		               |ИЗ
		               |	РемонтныеЦиклыРГ КАК РемонтныеЦиклыРГ
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РемонтныеЦиклыОРПодчинРГизРЦРГ КАК РемонтныеЦиклыОРПодчинРГизРЦРГ
		               |		ПО РемонтныеЦиклыРГ.ВидРемонта = РемонтныеЦиклыОРПодчинРГизРЦРГ.ВидРемонта
		               |			И (РемонтныеЦиклыОРПодчинРГизРЦРГ.ГруппаОбъектовРемонтов.ТиповойОР = РемонтныеЦиклыРГ.ГруппаОбъектовРемонтов)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	NULL КАК ВидЦепочки,
		               |	ПересечениеВРЦепочкиСНРОР.ГруппаОбъектовРемонтов,
		               |	ПересечениеВРЦепочкиСНРОР.ВидРемонта
		               |ИЗ
		               |	ПересечениеВРЦепочкиСНРОР КАК ПересечениеВРЦепочкиСНРОР
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	NULL,
		               |	ПересечениеВРЦепочкиСНРРГ.ГруппаОбъектовРемонтов,
		               |	ПересечениеВРЦепочкиСНРРГ.ВидРемонта
		               |ИЗ
		               |	ПересечениеВРЦепочкиСНРРГ КАК ПересечениеВРЦепочкиСНРРГ
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ПересечениеРемонтныхЦикловОР.ВидЦепочки,
		               |	ПересечениеРемонтныхЦикловОР.ГруппаОбъектовРемонтов,
		               |	ПересечениеРемонтныхЦикловОР.ВидРемонта
		               |ИЗ
		               |	ПересечениеРемонтныхЦикловОР КАК ПересечениеРемонтныхЦикловОР
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ПересечениеРемЦикловРГ.ВидЦепочки,
		               |	ПересечениеРемЦикловРГ.ГруппаОбъектовРемонтов,
		               |	ПересечениеРемЦикловРГ.ВидРемонта
		               |ИЗ
		               |	ПересечениеРемЦикловРГ КАК ПересечениеРемЦикловРГ
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	NULL,
		               |	ПересечениеЦепочекРГиНормативныхРемонтовОР.ГруппаОбъектовРемонтов,
		               |	ПересечениеЦепочекРГиНормативныхРемонтовОР.ВидРемонта
		               |ИЗ
		               |	ПересечениеЦепочекРГиНормативныхРемонтовОР КАК ПересечениеЦепочекРГиНормативныхРемонтовОР
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ПересечениеРЦРГсРЦПодчиненныхОР.ВидЦепочки,
		               |	ПересечениеРЦРГсРЦПодчиненныхОР.ГруппаОбъектовРемонтов,
		               |	ПересечениеРЦРГсРЦПодчиненныхОР.ВидРемонта
		               |ИЗ
		               |	ПересечениеРЦРГсРЦПодчиненныхОР КАК ПересечениеРЦРГсРЦПодчиненныхОР";
		
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		Запрос.УстановитьПараметр("ПоследовательностьРемонтов", Объект.ПоследовательностьРемонтов.Выгрузить());
		
		ТаблицаПересекающихсяВР = Запрос.Выполнить().Выгрузить();
		Если ТаблицаПересекающихсяВР.Количество()<>0 Тогда
			Для Каждого Строка Из ТаблицаПересекающихсяВР Цикл
				Если ЗначениеЗаполнено(Строка.ВидЦепочки) Тогда
					Если Строка.ВидЦепочки <> Объект.Ссылка Тогда
						ШаблонСообщения = НСтр("es='¡Es imposible cambiar la composición de la cadenita, ya que para ОР ""%1"" tipo de la reparación ""%2"" formará parte de la cadenita ""%3"" y la cadenita ""%4""!';ru='Невозможно изменить состав цепочки, поскольку для ОР ""%1"" вид ремонта ""%2"" будет входить в состав цепочки ""%3"" и цепочки ""%4""!';en='Unable to change the composition of the chain, because for PR ""%1"" the repair type ""%2"" will be included in the chain ""%3"" and the chain ""%4""!'");
						ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка.ГруппаОбъектовРемонтов, Строка.ВидРемонта, Объект.Ссылка, Строка.ВидЦепочки);
						ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
					КонецЕсли;
				Иначе	
					ШаблонСообщения = НСтр("es='¡Es imposible cambiar la composición de la cadenita, ya que para ОР ""%1"" tipo de la reparación ""%2"" es ya la reparación normativa, y la cadenita corriente forma parte del objeto dado!';ru='Невозможно изменить состав цепочки, поскольку для ОР ""%1"" вид ремонта ""%2"" уже является нормативным ремонтом, и текущая цепочка входит в состав данного объекта!';en='Unable to change the composition of the chain, because for PR ""%1"" the type of repair ""%2"" is already a standard repair, and the current chain is part of this object!'");
					ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка.ГруппаОбъектовРемонтов, Строка.ВидРемонта);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПоследовательностьРемонтовНормативныйРемонтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	ОткрытьФорму("Справочник.торо_ИдентификаторыТехКарт.ФормаВыбора", Новый Структура("ОтборПоСтатусам", ПредопределенноеЗначение("Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Действует")), Элемент);
КонецПроцедуры


&НаКлиенте
Процедура ПоследовательностьРемонтовНормативныйРемонтОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Не ТехКартаДействует(ВыбранноеЗначение) Тогда
		СтандартнаяОбработка = Ложь;
		ТекстСообщения = НСтр("es='¡Se puede escoger solamente la versión activa de la tarjeta técnica!';ru='Можно выбирать только действующую версию техкарты!';en='You can select only the current version of the task list!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ТехКартаДействует(ТехКарта)
	Если ТехКарта.статус = Перечисления.торо_СтатусыНормативныхРемонтовИТехКарт.Действует Тогда 		
		Возврат Истина;	
	Иначе 
		Возврат Ложь;
	КонецЕсли;
КонецФункции


&НаКлиенте
Процедура ПоследовательностьРемонтовВидРемонтаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Для Каждого СтрокаРемонта Из Объект.ПоследовательностьРемонтов Цикл
		Если ВыбранноеЗначение = СтрокаРемонта.ВидРемонта Тогда
			СтандартнаяОбработка = Ложь;
			ТекстСообщения = НСтр("es='¡Un tipo de la reparación no es posible añadir algunas veces!';ru='Один вид ремонта нельзя добавить несколько раз!';en='One type of repair cannot be added several times!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ПоследовательностьРемонтовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Копирование = Истина И ЗначениеЗаполнено(Элемент.ТекущиеДанные.ВидРемонта) Тогда
		ТекстСообщения = НСтр("es='¡Un tipo de la reparación no es posible añadir algunas veces!';ru='Один вид ремонта нельзя добавить несколько раз!';en='One type of repair cannot be added several times!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
